app/Controllers/Home.php

    public function registrarUsuario()
    {
        $data['name'] = $this->request->getPost('name');
        $data['email'] = $this->request->getPost('email');

// embaralhamento de senha
        $password = $this->request->getPost('password');
        $hash = password_hash($password, PASSWORD_BCRYPT);

        $data['password'] = $hash;

        $this->usersModel->insert($data);
---
INSERT INTO `Users` (`name`, `email`, `password`) VALUES ('Eduardo Wenzel Brião', 'eduardo.briao@gmail.com', '$2y$10$HRXtg6sDaEIzap6g15eFIeZY6Xj5RO8jNLhwD6vWfZ8rCfICxxXVS')

    public function loginUser()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->usersModel->where('email', $email)->first();
---
SELECT *
FROM `Users`
WHERE `email` = 'eduardo.briao@gmail.com'
 LIMIT 1